{
  "sinewave": "Description: Generates a sinewave.  All parameters are optional.  By default, amplitude = 1, cycles = 1, and data length = 512.  Syntax: sw = sinewave(); or, optionally, sw = sinewave(amp, cycles, len);  Example: amp = 12; cycles = 4; len = 300; sw = sinewave(amp, cycles, len);  See also: squarewave, trianglewave, sawtoothwave, impulse, step, gauss",

  "squarewave": "Description: Generates a squarewave.  All parameters are optional.  By default, amplitude = 1, cycles = 1, data length = 512 and scale = 20 (scale can change edge rate where scale = 1 is a sinewave).  Syntax: sqw = squarewave(); or, optionally, sqw = squarewave(amp, cycles, len, scale);  Example: amp = 12; cycles = 4; len = 300; scale = 40; sqw = squarewave(amp, cycles, len, scale);  See also: sinewave, trianglewave, sawtoothwave, impulse, step, gauss",

  "trianglewave": "Description: Generates a trianglewave.  All parameters are optional.  By default, amplitude = 1, cycles = 1, and data length = 512.  Syntax: tw = trianglewave(); or, optionally, tw = trianglewave(amp, cycles, len);  Example: amp = 12; cycles = 4; len = 300; tw = trianglewave(amp, cycles, length);  See also: sinewave, squarewave, sawtoothwave, impulse, step, gauss",

  "step": "Description: Generates a step waveform.  All parameters are optional.  By default, data length = 512 and step position is length / 4.  Syntax: st = step(); or, optionally, st = step(len, position);  Example: len = 300; position = 50; st = step(len, position);  See also: sinewave, squarewave, trianglewave, sawtoothwave, impulse, gauss",

  "xaxis": "Description: Adds a label to the x axis of the current chart.  The label argument is space delimited.  String name can be single or double quoted but apostrophes must be escaped with a backslash.  Syntax: xaxis 'This is the x axis'  Example: x = 1:10; y = square(x); sample x y  xaxis 'samples (n)' See also: bar, column, line, linepts, curve, curvepts, sample, samplen, title, subtitle, yaxis, series",

  "yaxis": "Description: Adds a label to the y axis of the current chart.  The label argument is space delimited.  String name can be single or double quoted but apostrophes must be escaped.  Syntax: yaxis 'This is the y axis'  Example: x = 1:10; y = square(x); sample x y  yaxis 'square (n)' See also: bar, column, line, linepts, curve, curvepts, sample, samplen, title, subtitle, xaxis, series",

  "title": "Description: Adds a title to the current chart.  Arguments are space delimited.  The title string is required and a color string for styling the title is optional.  String name can be single or double quoted but apostrophes must be escaped with a backslash.  Syntax: title 'This is the title' 'red'  Example: x = 1:10; y = square(x); sample x y  title 'The square of x' '#90ed7d' See also: bar, column, line, linepts, curve, curvepts, sample, samplen, subtitle, xaxis, yaxis, series",

  "subtitle": "Description: Adds a subtitle to the current chart.  Arguments are space delimited.  The subtitle string is required and a color string for styling the subtitle is optional.  String name can be single or double quoted but postrophes must be escaped with a backslash.  Syntax: subtitle 'This is the subtitle' 'red'  Example: x = 1:10; y = square(x); sample x y  title 'The square of x' '#90ed7d' subtitle 'for x from 1 to 10'  See also: bar, column, line, linepts, curve, curvepts, sample, samplen, title, xaxis, yaxis, series",

  "vars": "Description: Displays the terminal variables that have been defined to the scope using the equal sign.  Syntax: vars  Example: x = 3; y = [1,2,3,4]; vars  Displays x, y  See also: loadvars, savevars, importfile, importurl, importlog",

  "exportfile": "",
  
  "subseqs": ""
}